Repository: ArqinT/python-discord-rom-bot-github
Catalog: locale/*/LC_MESSAGES/discord_cogs/prices.po
Languages: ru

source: price is lower than
ru: цена ниже чем

source: price is higher than
ru: цена выше чем

source: volume is lower than
ru: объём ниже чем

source: volume is higher than
ru: объём выше чем

source: price change is higher than
ru: изменение цены больше чем

source: volume change is higher than
ru: изменение объёма больше чем

source: price change percentage is higher than
ru: процентное изменение цены больше чем

source: volume change percentage is higher than
ru: процентное изменение объёма больше чем

source: {mention} Trigger(ID:{trigger_id}) occurred for {item_name} {trigger_type} {value:,}. Current price: {price:,}, volume: {volume:,}.
ru: {mention} Сработал триггер(ID:{trigger_id}) {item_name} {trigger_type} {value:,}. Текущая цена: {price:,}, объём: {volume:,}.

source: Last price: {last_price:,}, volume: {last_volume:,}.
ru: Прошлая цена: {last_price:,}, объём: {last_volume:,}.

source: Snapping till {snapping_datetime:%H:%M}
ru: В снэппе до {snapping_datetime:%H:%M}

source: Item name "{item_name}" was not found in DB.
ru: Предмет "{item_name}" не был найден в БД.

source: Trigger type "{trigger_type}" was not found.
ru: Тип триггера "{trigger_type}" не был найден.

source: Adds price trigger for yourself.
ru: Добавляет ценовой триггер для себя.

source: Use /pt_types to get list of all possible trigger types
ru: Используйте /pt_types для получения полного списка возможных типов триггеров

source: "Hydra Card" p< 10000 - will trigger if price for Hydra Card lower than 10.000
ru: "Hydra Card" p< 10000 - установит триггер, срабатывающий, если цена на Карту Гидры опустится ниже 10000

source: {mention} You will be notified when {trigger_description} {value:,} for {item_name}. Current price: {price:,}, volume: {volume:,}.
ru: {mention} Вы будете уведомлены, если для {item_name} будет {trigger_description} {value:,}. Текущая цена: {price:,}, объём: {volume:,}.

source: Lists triggers for self.
ru: Выводит список триггеров настроенных для вас.

source: {mention} Your triggers are: {triggers}
ru: {mention} Ваши триггеры: {triggers}

source: {mention} You don't have any triggers.
ru: {mention} У вас нет триггеров.

source: You don't have admin rights to use it for others.
ru: У вас нет прав использовать данную команду для других.

source: User_id({user_id}) was not found in DB.
ru: User_id({user_id}) не был найден в БД.

source: {mention} Triggers for user_id({user_id}) are: {triggers}
ru: {mention} Триггеры для user_id({user_id}): {triggers}

source: {mention} User_id({user_id}) don't have any triggers.
ru: {mention} У User_id({user_id}) нет триггеров.

source: Lists all trigger types.
ru: Выводит список всех типов триггеров.

source: Item name "{item_name}" was not found.
ru: Имя предмета "{item_name}" не было найдено.

source: ```List of possible price triggers: {triggers}```
ru: ```Список возможных типов триггеров: {triggers}```

source: Deletes price trigger by ID.
ru: Удаляет ценовой триггер по ID.

source: {mention} price trigger (ID:{trigger_id}) is not yours.
ru: {mention} ценовой триггер {trigger_id} не принадлежит вам.

source: {mention} price trigger {trigger_id} was deleted.
ru: {mention} ценовой триггер {trigger_id} был удалён.

source: Returns current price.
ru: Возвращает текущую цену.

source: {mention} Price: {price:,}, volume: {volume:,}, date: {relevance:%d %b %Y %H:%M}
ru: {mention} Цена: {price:,}, объём: {volume:,}, дата: {relevance:%d %b %Y %H:%M}

source: {mention} Price point for {item_name} was not found in DB
ru: {mention} Цена предмета "{item_name}" не была найдена в БД

source: {mention} Item {item_name} was not found in DB
ru: {mention} Предмет "{item_name}" не был найден в БД

source: Saves your chosen channel and send triggers there.
ru: Сохраняет выбранный канал и отправляет триггеры туда.

source: Returns last update datetime.
ru: Возвращает последнюю дату обновления.

source: {mention} Last update was at {update_datetime}.
ru: {mention} Последнее обновление было {update_datetime}.

source: Shows changelog.
ru: Выводит список изменений.
